/**
 * 正则表示大全
 * regexList.get('email') //邮箱正则
 * @type {Map<any, any>}
 */
const regexList = new Map([
    // url
    ['url', /^http[s]?:\/\/.*/],
    // 邮箱
    ['email', /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/],

    // 手机号码
    ['mobile', /^(1)\d{10}$/],

    // 身份证号
    ['idCardNumber', /^[1-9]([0-9]{16}|[0-9]{13})[xX0-9]$/i],

    //11位手机号码或者12位电话号码
    ['phoneAndChMobile', /^((0\d{2,3}-\d{7,8})|(1[0-9][0-9]\d{8,8}))$/],

    //姓名，2-10个汉字，不包括空格
    ['name', /^[\u4E00-\u9FA5]{2,10}$/],

    //18位统一社会编码，限制输入18位数字+大写英文组合
    ['ENumber18', /^([A-Z0-9]{18})$/],

    //中英文和数字组合，
    ['notSpecial', /^[\u4E00-\u9FA5A-Za-z0-9]+$/],

    //电话号码('XXX-XXXXXXX'、'XXXX-XXXXXXXX'、'XXX-XXXXXXX'、'XXX-XXXXXXXX'、'XXXXXXX'和XXXXXXXX)
    ['phone', /^(\d{3,4}-)?\d{7,8}$/],

    //身份证号,号码为15位或者18位，15位时全为数字，18位前17位为数字，最后一位是校验位，可能为数字或字符X
    ['idCode', /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/],

    //密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)
    ['password', /^[a-zA-Z\w]{6,18}$/],

    //金额(只能正数金额)
    ['balance', /(^[1-9](\d+)?(\.\d{1,2})?$)|(^0$)|(^\d\.\d{1,2}$)/],
    // >=0的整数和一位小数
    ['price', /(^[1-9](\d+)?(\.\d{1})?$)|(^0$)|(^\d\.\d{1}$)/],

    //整数或两位小数正则
    ['number', /^([0-9]*)((\.)([0-9]){1,2})?$/],

    // 仅限2个字以上的中文
    ['characters', /^[\S][\u4e00-\u9fa5]+$/],
    ['chargeRate', /^[0-9]{1,2}$/],
    ['EandN', /^[a-zA-Z0-9]*$/],
    ['EandN2', /^[\S][A-Z0-9]*$/],
    ['number*', /^[0-9]*$/],
]);

export default regexList;
